#### Units Members

---

|  |
| --- |
| Units Class   Constructors   Methods   Properties   See Also |

The  Units  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | Units | Creates a new Units object with default settings for Metric or Imperial units. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  Units |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetFormatOptions | Gets the default FormatOptions for a spec. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method Static member | GetModifiableSpecs | Gets all specs for which the default FormatOptions can be modified. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | IsModifiableSpec | Checks whether the default FormatOptions can be modified for a given spec. |
| Public method | SetFormatOptions | Sets the default FormatOptions for a spec. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DecimalSymbol | The symbol used to separate the integer and fractional parts of a number. |
| Public property | DigitGroupingAmount | The number of digits in each group when numbers are formatted with digit grouping. |
| Public property | DigitGroupingSymbol | The symbol used to separate groups of digits when numbers are formatted with digit grouping. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

Units Class

Autodesk.Revit.DB Namespace